Seeed-Solution/SenseCAP_Indicator_ESP32/examples/indicator_matter/main/model/indicator_matter.cpp
#include "indicator_matter.h"
#include "indicator_storage.h"
#include "matter_config.h"

#include <esp_log.h>
#include <esp_matter.h>
#include <esp_wifi.h>
#include <nvs_flash.h>
#include <platform/CHIPDeviceLayer.h>
#include <platform/ESP32/ESP32Utils.h>
#include <app/server/CommissioningWindowManager.h>
#include <app/server/Server.h>

#if CHIP_DEVICE_CONFIG_ENABLE_THREAD
#include <platform/ESP32/OpenthreadLauncher.h>
#endif

static const char *TAG = "matter";
uint16_t temperature_endpoint_id = 0;
uint16_t humidity_endpoint_id = 0;
uint16_t dimmable_plugin_unit_endpoint_id = 0;
uint16_t door_lock_endpoint_id = 0;
uint16_t dimmable_plugin_unit_endpoint2_id = 0;

static bool __g_matter_connected_flag = false;
static bool __g_ip_connected_flag = false;

static int __g_humidity = 0;
static int __g_temperature = 0;
static struct view_data_wifi_st __g_wifi_st;
static SemaphoreHandle_t       __g_matter_mutex;
static esp_timer_handle_t   matter_humidity_timer_handle;
static esp_timer_handle_t   matter_temperature_timer_handle; 

using namespace esp_matter;
using namespace esp_matter::attribute;
using namespace esp_matter::endpoint;
using namespace chip::app::Clusters;
using namespace esp_matter::cluster::basic_information::attribute;

constexpr auto k_timeout_seconds = 300;

static void __wifi_st_set( struct view_data_wifi_st *p_st )
{
    xSemaphoreTake(__g_matter_mutex, portMAX_DELAY);
    memcpy( &__g_wifi_st, p_st, sizeof(struct view_data_wifi_st));
    xSemaphoreGive(__g_matter_mutex);
}

static void __wifi_st_get(struct view_data_wifi_st *p_st )
{
    xSemaphoreTake(__g_matter_mutex, portMAX_DELAY);
    memcpy(p_st, &__g_wifi_st, sizeof(struct view_data_wifi_st));
    xSemaphoreGive(__g_matter_mutex);
}

static void __humidity_value_set( int h )
{
    xSemaphoreTake(__g_matter_mutex, portMAX_DELAY);
    __g_humidity = h;
    xSemaphoreGive(__g_matter_mutex);
}

static int __humidity_value_get(void)
{
    xSemaphoreTake(__g_matter_mutex, portMAX_DELAY);
    int h =  __g_humidity;
    xSemaphoreGive(__g_matter_mutex);
    return h;
}

static void __temperature_value_set( int t )
{
    xSemaphoreTake(__g_matter_mutex, portMAX_DELAY);
    int value = t;
    __g_temperature = value;
    xSemaphoreGive(__g_matter_mutex);
}

static int __temperature_value_get(void)
{
    xSemaphoreTake(__g_matter_mutex, portMAX_DELAY);
    int t =  __g_temperature;
    xSemaphoreGive(__g_matter_mutex);
    return t;
}

static void app_event_cb(const ChipDeviceEvent *event, intptr_t arg)
{
    switch (event->Type) {
    case chip::DeviceLayer::DeviceEventType::kServerReady:
        ESP_LOGI(TAG, "Server Ready");
        __g_matter_connected_flag = true;
        if (__g_matter_connected_flag) {
            struct view_data_wifi_st st;
            __wifi_st_get(&st);
            st.rssi = -50;
            st.is_connected = true;
            
            __wifi_st_set(&st);
            esp_event_post_to(view_event_handle, VIEW_EVENT_BASE, VIEW_EVENT_WIFI_ST, &st, sizeof(struct view_data_wifi_st ), portMAX_DELAY);

            uint8_t screen = SCREEN_DASHBOARD;
            ESP_ERROR_CHECK(esp_event_post_to(view_event_handle, VIEW_EVENT_BASE, VIEW_EVENT_SCREEN_START, &screen, sizeof(screen), portMAX_DELAY));
        }
        break;
    case chip::DeviceLayer::DeviceEventType::kInterfaceIpAddressChanged:
        ESP_LOGI(TAG, "IP Interface Address Changed");
        if (event->InterfaceIpAddressChanged.Type == chip::DeviceLayer::InterfaceIpChangeType::kIpV6_Assigned ||
                        event->InterfaceIpAddressChanged.Type == chip::DeviceLayer::InterfaceIpChangeType::kIpV4_Assigned) {
            __g_ip_connected_flag = true;
        }
        break;
    case chip::DeviceLayer::DeviceEventType::kCommissioningComplete: {
        ESP_LOGI(TAG, "Connected");
        __g_matter_connected_flag = true;
        break;
    }
    case chip::DeviceLayer::DeviceEventType::kFailSafeTimerExpired:
        ESP_LOGI(TAG, "Commissioning failed, fail safe timer expired");
        break;

    case chip::DeviceLayer::DeviceEventType::kCommissioningSessionStarted:
        ESP_LOGI(TAG, "Commissioning session started");
        break;

    case chip::DeviceLayer::DeviceEventType::kCommissioningSessionStopped:
        ESP_LOGI(TAG, "Commissioning session stopped");
        break;

    case chip::DeviceLayer::DeviceEventType::kCommissioningWindowOpened:
        ESP_LOGI(TAG, "Commissioning window opened");
        break;

    case chip::DeviceLayer::DeviceEventType::kCommissioningWindowClosed:
    {
        ESP_LOGI(TAG, "Commissioning window closed");
        break;
    }
    case chip::DeviceLayer::DeviceEventType::kFabricRemoved:
    {
            ESP_LOGI(TAG, "Fabric removed successfully");
            if (chip::Server::GetInstance().GetFabricTable().FabricCount() == 0)
            {
                chip::CommissioningWindowManager & commissionMgr = chip::Server::GetInstance().GetCommissioningWindowManager();
                constexpr auto kTimeoutSeconds = chip::System::Clock::Seconds16(k_timeout_seconds);
                if (!commissionMgr.IsCommissioningWindowOpen())
                {
                    CHIP_ERROR err = commissionMgr.OpenBasicCommissioningWindow(kTimeoutSeconds,
                                                    chip::CommissioningWindowAdvertisement::kDnssdOnly);
                    if (err != CHIP_NO_ERROR)
                    {
                        ESP_LOGE(TAG, "Failed to open commissioning window, err:%" CHIP_ERROR_FORMAT, err.Format());
                    }
                }
            }
        break;
    }
    case chip::DeviceLayer::DeviceEventType::kFabricWillBeRemoved:
        ESP_LOGI(TAG, "Fabric will be removed");
        break;

    case chip::DeviceLayer::DeviceEventType::kFabricUpdated:
        ESP_LOGI(TAG, "Fabric is updated");
        break;

    case chip::DeviceLayer::DeviceEventType::kFabricCommitted:
        ESP_LOGI(TAG, "Fabric is committed");
        break;
    default:
        break;
    }
}

static esp_err_t app_identification_cb(identification::callback_type_t type, uint16_t endpoint_id, uint8_t effect_id,
                                       uint8_t effect_variant, void *priv_data)
{
    ESP_LOGI(TAG, "Identification callback: type: %u, effect: %u, variant: %u", type, effect_id, effect_variant);
    return ESP_OK;
}

static esp_err_t app_attribute_update_cb(attribute::callback_type_t type, uint16_t endpoint_id, uint32_t cluster_id,
                                         uint32_t attribute_id, esp_matter_attr_val_t *val, void *priv_data)
{
    esp_err_t err = ESP_OK;
    if (type == PRE_UPDATE) {
        esp_err_t err = ESP_OK;     
        if (endpoint_id == dimmable_plugin_unit_endpoint_id) {
            if (cluster_id == OnOff::Id) {
                if (attribute_id == OnOff::Attributes::OnOff::Id) {
                    struct view_data_matter_dashboard_data data;
                    data.dashboard_data_type = DASHBOARD_DATA_BUTTON1;
                    data.value = (int)val->val.b;
                    esp_event_post_to(view_event_handle, VIEW_EVENT_BASE, VIEW_EVENT_MATTER_SET_DASHBOARD_DATA, \
                        &data, sizeof(struct view_data_matter_dashboard_data ), portMAX_DELAY);
                }
            } else if (cluster_id == LevelControl::Id) {
                if (attribute_id == LevelControl::Attributes::CurrentLevel::Id) {
                    struct view_data_matter_dashboard_data data;
                    data.dashboard_data_type = DASHBOARD_DATA_ARC;
                    data.value = val->val.i;
                    esp_event_post_to(view_event_handle, VIEW_EVENT_BASE, VIEW_EVENT_MATTER_SET_DASHBOARD_DATA, \
                        &data, sizeof(struct view_data_matter_dashboard_data ), portMAX_DELAY);                    
                }
            }
        } else if (endpoint_id == dimmable_plugin_unit_endpoint2_id) {
            if (cluster_id == OnOff::Id) {
                if (attribute_id == OnOff::Attributes::OnOff::Id) {
                    struct view_data_matter_dashboard_data data;
                    data.dashboard_data_type = DASHBOARD_DATA_BUTTON2;
                    data.value = (int)val->val.b;
                    esp_event_post_to(view_event_handle, VIEW_EVENT_BASE, VIEW_EVENT_MATTER_SET_DASHBOARD_DATA, \
                        &data, sizeof(struct view_data_matter_dashboard_data ), portMAX_DELAY);
                    
