Seeed-Solution/SenseCAP_Indicator_ESP32/examples/indicator_matter/main/model/indicator_matter.cpp
                }
            } else if (cluster_id == LevelControl::Id) {
                if (attribute_id == LevelControl::Attributes::CurrentLevel::Id) {
                    struct view_data_matter_dashboard_data data;
                    data.dashboard_data_type = DASHBOARD_DATA_SLIDER;
                    data.value = val->val.i;
                    esp_event_post_to(view_event_handle, VIEW_EVENT_BASE, VIEW_EVENT_MATTER_SET_DASHBOARD_DATA, \
                        &data, sizeof(struct view_data_matter_dashboard_data ), portMAX_DELAY);                     
                }
            }
        } else if (endpoint_id == door_lock_endpoint_id) {
            if (cluster_id == DoorLock::Id) {
                if (attribute_id == DoorLock::Attributes::LockState::Id) {
                    struct view_data_matter_dashboard_data data;
                    data.dashboard_data_type = DASHBOARD_DATA_SWITCH;
                    data.value = (int)val->val.b;
                    esp_event_post_to(view_event_handle, VIEW_EVENT_BASE, VIEW_EVENT_MATTER_SET_DASHBOARD_DATA, \
                        &data, sizeof(struct view_data_matter_dashboard_data ), portMAX_DELAY);
                }
            }
        }
        return err;
    }

    return err;
}

static void __matter_temperature_reporter(void* arg) {       
    if (__g_matter_connected_flag && __g_ip_connected_flag) {       
        uint16_t endpoint_id = temperature_endpoint_id;
        uint32_t cluster_id = TemperatureMeasurement::Id;
        uint32_t attribute_id = TemperatureMeasurement::Attributes::MeasuredValue::Id;
        node_t *node = node::get();
        endpoint_t *endpoint = endpoint::get(node, endpoint_id);
        cluster_t *cluster = cluster::get(endpoint, cluster_id);
        attribute_t *attribute = attribute::get(cluster, attribute_id);
        esp_matter_attr_val_t val = esp_matter_invalid(NULL);
        attribute::get_val(attribute, &val);
        val.val.i16 = (int16_t) __temperature_value_get();

        ESP_LOGI(TAG, "Temperature: esp_matter_attr_val_t value is %d", val.val.i16);

        
        attribute::update(endpoint_id, cluster_id, attribute_id, &val);
        
    } else {
        int value = (int)(__temperature_value_get() / 1000.0);
        ESP_LOGI(TAG, "Matter temperature not logging: esp_matter_attr_val_t value is %d", value);
    }
}

static void __matter_humidity_reporter(void* arg) {   
    if (__g_matter_connected_flag && __g_ip_connected_flag) {       
        uint16_t endpoint_id = humidity_endpoint_id;
        uint32_t cluster_id = RelativeHumidityMeasurement::Id;
        uint32_t attribute_id = RelativeHumidityMeasurement::Attributes::MeasuredValue::Id;
        node_t *node = node::get();
        endpoint_t *endpoint = endpoint::get(node, endpoint_id);
        cluster_t *cluster = cluster::get(endpoint, RelativeHumidityMeasurement::Id);
        attribute_t *attribute = attribute::get(cluster, RelativeHumidityMeasurement::Attributes::MeasuredValue::Id);
        esp_matter_attr_val_t val = esp_matter_invalid(NULL);
        attribute::get_val(attribute, &val);
        val.val.i16 = (int16_t) __humidity_value_get();

        ESP_LOGI(TAG, "Humidity: esp_matter_attr_val_t value is %d", val.val.i);
        
        attribute::update(endpoint_id, cluster_id, attribute_id, &val);
        
    } else {
        int value = (int)(__humidity_value_get() / 1000.0);
        ESP_LOGI(TAG, "Matter humidity not logging: esp_matter_attr_val_t value is %d", value);   
    }
}

static void __view_event_handler(void* handler_args, esp_event_base_t base, int32_t id, void* event_data)
{
    switch (id)
    {
        case VIEW_EVENT_SHUTDOWN: {
            ESP_LOGI(TAG, "event: VIEW_EVENT_SHUTDOWN");
            break;
        }
        case VIEW_EVENT_MATTER_DASHBOARD_DATA: {
            ESP_LOGI(TAG, "event: VIEW_EVENT_MATTER_DASHBOARD_DATA");

            if (!__g_matter_connected_flag) {
                return;
            }
            struct view_data_matter_dashboard_data  *p_data = (struct view_data_matter_dashboard_data *) event_data;

            switch (p_data->dashboard_data_type)
            {
                case DASHBOARD_DATA_ARC: {
                    uint16_t endpoint_id = dimmable_plugin_unit_endpoint_id;
                    uint32_t cluster_id = LevelControl::Id;
                    uint32_t attribute_id = LevelControl::Attributes::CurrentLevel::Id;

                    node_t *node = node::get();
                    endpoint_t *endpoint = endpoint::get(node, endpoint_id);
                    cluster_t *cluster = cluster::get(endpoint, cluster_id);
                    attribute_t *attribute = attribute::get(cluster, attribute_id);

                    esp_matter_attr_val_t val = esp_matter_invalid(NULL);
                    attribute::get_val(attribute, &val);
                    val.val.i = p_data->value;
                    ESP_LOGI(TAG, "Dimmer switch: esp_matter_attr_val_t value is %d", val.val.i);
                    attribute::update(endpoint_id, cluster_id, attribute_id, &val);
                    break;
                }
                case DASHBOARD_DATA_SWITCH: {
                    uint16_t endpoint_id = door_lock_endpoint_id;
                    uint32_t cluster_id = DoorLock::Id;
                    uint32_t attribute_id = DoorLock::Attributes::LockState::Id;
                    node_t *node = node::get();
                    endpoint_t *endpoint = endpoint::get(node, endpoint_id);
                    cluster_t *cluster = cluster::get(endpoint, cluster_id);
                    attribute_t *attribute = attribute::get(cluster, attribute_id);

                    esp_matter_attr_val_t val = esp_matter_invalid(NULL);
                    attribute::get_val(attribute, &val);
                    val.val.b = (bool)p_data->value;
                    ESP_LOGI(TAG, "Door lock: esp_matter_attr_val_t value is %d", (int)val.val.b);
                    
                    attribute::update(endpoint_id, cluster_id, attribute_id, &val);
                    
                    break;
                }
                case DASHBOARD_DATA_SLIDER: {
                    uint16_t endpoint_id = dimmable_plugin_unit_endpoint2_id;
                    uint32_t cluster_id = LevelControl::Id;
                    uint32_t attribute_id = LevelControl::Attributes::CurrentLevel::Id;

                    node_t *node = node::get();
                    endpoint_t *endpoint = endpoint::get(node, endpoint_id);
                    cluster_t *cluster = cluster::get(endpoint, cluster_id);
                    attribute_t *attribute = attribute::get(cluster, attribute_id);

