Seeed-Solution/SenseCAP_Indicator_ESP32/examples/indicator_matter/main/model/indicator_matter.cpp
                    esp_matter_attr_val_t val = esp_matter_invalid(NULL);
                    attribute::get_val(attribute, &val);
                    val.val.i = p_data->value;

                    ESP_LOGI(TAG, "Dimmer switch: esp_matter_attr_val_t value is %d", val.val.i);
                    
                    attribute::update(endpoint_id, cluster_id, attribute_id, &val);
                    
                    break;
                }
                case DASHBOARD_DATA_BUTTON1: {
                    uint16_t endpoint_id = dimmable_plugin_unit_endpoint_id;
                    uint32_t cluster_id = OnOff::Id;
                    uint32_t attribute_id = OnOff::Attributes::OnOff::Id;

                    node_t *node = node::get();
                    endpoint_t *endpoint = endpoint::get(node, endpoint_id);
                    cluster_t *cluster = cluster::get(endpoint, cluster_id);
                    attribute_t *attribute = attribute::get(cluster, attribute_id);

                    esp_matter_attr_val_t val = esp_matter_invalid(NULL);
                    attribute::get_val(attribute, &val);
                    val.val.b = (bool)p_data->value;

                    ESP_LOGI(TAG, "Dimmer switch: esp_matter_attr_val_t value is %d", (int)val.val.b);
                    
                    attribute::update(endpoint_id, cluster_id, attribute_id, &val);
                    
                    break;
                }
                case DASHBOARD_DATA_BUTTON2: {
                    uint16_t endpoint_id = dimmable_plugin_unit_endpoint2_id;
                    uint32_t cluster_id = OnOff::Id;
                    uint32_t attribute_id = OnOff::Attributes::OnOff::Id;

                    node_t *node = node::get();
                    endpoint_t *endpoint = endpoint::get(node, endpoint_id);
                    cluster_t *cluster = cluster::get(endpoint, cluster_id);
                    attribute_t *attribute = attribute::get(cluster, attribute_id);

                    esp_matter_attr_val_t val = esp_matter_invalid(NULL);
                    attribute::get_val(attribute, &val);
                    val.val.b = (bool)p_data->value;

                    ESP_LOGI(TAG, "Dimmer on/off: esp_matter_attr_val_t value is %d", (int)val.val.b);
                    
                    attribute::update(endpoint_id, cluster_id, attribute_id, &val);
                    
                    break;
                }
                default:
                    break;
            }
            break;
        }
        case VIEW_EVENT_SENSOR_DATA: {
            ESP_LOGI(TAG, "event: VIEW_EVENT_SENSOR_DATA");

            struct view_data_sensor_data  *p_data = (struct view_data_sensor_data *) event_data;

            switch (p_data->sensor_type)
            {
                case SENSOR_DATA_CO2: {
                    break;
                }
                case SENSOR_DATA_TVOC: {
                    break;
                }
                case SENSOR_DATA_TEMP: {
                    int temperature = (int)(p_data->value*100);
                    __temperature_value_set(temperature);
                    break;
                }
                case SENSOR_DATA_HUMIDITY: {
                    int humidity = (int)(p_data->value*100);
                    __humidity_value_set(humidity);
                    break;
                }
                default:
                    break;
            }
            break;
        }
        default:
            break;
    }
}

int indicator_matter_setup(void) {
    esp_err_t err = ESP_OK;
    __g_matter_connected_flag = chip::DeviceLayer::Internal::ESP32Utils::IsStationProvisioned();
    memset(&__g_wifi_st, 0, sizeof(__g_wifi_st));
    __g_matter_mutex  =  xSemaphoreCreateMutex();  
    node::config_t node_config;
    node_t *node = node::create(&node_config, app_attribute_update_cb, app_identification_cb);

    // Create the temperature endpoint
    temperature_sensor::config_t temperature_config;
    endpoint_t *temperature_endpoint = temperature_sensor::create(node, &temperature_config, ENDPOINT_FLAG_NONE, NULL);
    char temperature_name[]  = "SenseCAP Indicator Temperature";
    cluster_t *temperature_cluster = cluster::get(temperature_endpoint, BasicInformation::Id);
    create_product_name(temperature_cluster, temperature_name, strlen(temperature_name));

    // Create the humidity endpoint
    humidity_sensor::config_t humidity_config;
    endpoint_t *humidity_endpoint = humidity_sensor::create(node, &humidity_config, ENDPOINT_FLAG_NONE, NULL);
    char humidity_name[]  = "SenseCAP Indicator Humidity";
    cluster_t *humidity_cluster = cluster::get(temperature_endpoint, BasicInformation::Id);
    create_product_name(humidity_cluster, humidity_name, strlen(humidity_name));

    // Create the dimmable light endpoint
    dimmable_plugin_unit::config_t dimmable_plugin_unit_config;
    dimmable_plugin_unit_config.level_control.lighting.min_level = 0;
    dimmable_plugin_unit_config.level_control.lighting.max_level = 100;
    endpoint_t *dimmable_plugin_unit_endpoint = dimmable_plugin_unit::create(node, &dimmable_plugin_unit_config, ENDPOINT_FLAG_NONE, NULL);
    char dimmable_plugin_1_name[]  = "Dimmable Light";
    cluster_t *dimmable_plugin_1_cluster = cluster::get(dimmable_plugin_unit_endpoint, BasicInformation::Id);
    create_product_name(dimmable_plugin_1_cluster, dimmable_plugin_1_name, strlen(dimmable_plugin_1_name));

    // Create the contact sensor endpoint
    door_lock::config_t door_lock_config;
    endpoint_t *door_lock_endpoint = door_lock::create(node, &door_lock_config, ENDPOINT_FLAG_NONE, NULL);
    char door_lock_name[]  = "Virtual Lockbox";
    cluster_t *door_lock_cluster = cluster::get(door_lock_endpoint, BasicInformation::Id);
    create_product_name(door_lock_cluster, door_lock_name, strlen(door_lock_name));

    dimmable_plugin_unit::config_t dimmable_plugin_unit_config2;
    char dimmable_plugin_2_name[]  = "Dimmable Light 2";
    cluster_t *dimmable_plugin_2_cluster = cluster::get(door_lock_endpoint, BasicInformation::Id);
    create_product_name(dimmable_plugin_2_cluster, dimmable_plugin_2_name, strlen(dimmable_plugin_2_name));
    dimmable_plugin_unit_config2.level_control.lighting.min_level = 0;
    dimmable_plugin_unit_config2.level_control.lighting.max_level = 100;
    endpoint_t *dimmable_plugin_unit_endpoint2 = dimmable_plugin_unit::create(node, &dimmable_plugin_unit_config2, ENDPOINT_FLAG_NONE, NULL);

