Seeed-Solution/SenseCAP_Indicator_ESP32/examples/indicator_matter/main/model/indicator_matter.cpp
    if (!node || 
        !temperature_endpoint || 
        !humidity_endpoint ||
        !dimmable_plugin_unit_endpoint ||
        !door_lock_endpoint ||
        !dimmable_plugin_unit_endpoint2
    ) {
        ESP_LOGE(TAG, "Matter node creation failed");
    }

    temperature_endpoint_id = endpoint::get_id(temperature_endpoint);
    ESP_LOGI(TAG, "Temperature sensor created with endpoint_id %d", temperature_endpoint_id);

    humidity_endpoint_id = endpoint::get_id(humidity_endpoint);
    ESP_LOGI(TAG, "Humidity sensor created with endpoint_id %d", humidity_endpoint_id);

    dimmable_plugin_unit_endpoint_id = endpoint::get_id(dimmable_plugin_unit_endpoint);
    ESP_LOGI(TAG, "Dimmable light created with endpoint_id %d", dimmable_plugin_unit_endpoint_id);

    door_lock_endpoint_id = endpoint::get_id(door_lock_endpoint);
    ESP_LOGI(TAG, "Door lock created with endpoint_id %d", door_lock_endpoint_id);

    dimmable_plugin_unit_endpoint2_id = endpoint::get_id(dimmable_plugin_unit_endpoint2);
    ESP_LOGI(TAG, "Dimmable plugin 2 unit created with endpoint_id %d", dimmable_plugin_unit_endpoint2_id);

#if CHIP_DEVICE_CONFIG_ENABLE_THREAD
    /* Set OpenThread platform config */
    esp_openthread_platform_config_t config = {
        .radio_config = ESP_OPENTHREAD_DEFAULT_RADIO_CONFIG(),
        .host_config = ESP_OPENTHREAD_DEFAULT_HOST_CONFIG(),
        .port_config = ESP_OPENTHREAD_DEFAULT_PORT_CONFIG(),
    };
    set_openthread_platform_config(&config);
#endif

    /* Matter start */
    err = esp_matter::start(app_event_cb);
    if (err != ESP_OK) {
        ESP_LOGI(TAG, "Matter start failed: %d", err);
    }

    return err;
} 

int indicator_matter_init(void) {
    __g_matter_connected_flag = chip::DeviceLayer::Internal::ESP32Utils::IsStationProvisioned();
    if (!__g_matter_connected_flag) {
        ESP_LOGI(TAG, "Beginning Matter Provisioning");
        uint8_t screen = SCREEN_MATTER_CONFIG;
        ESP_ERROR_CHECK(esp_event_post_to(view_event_handle, VIEW_EVENT_BASE, VIEW_EVENT_SCREEN_START, &screen, sizeof(screen), portMAX_DELAY));
    }
    const esp_timer_create_args_t temperature_timer_args = {
            .callback = &__matter_temperature_reporter,
            /* argument specified here will be passed to timer callback function */
            .arg = (void*) matter_temperature_timer_handle,
            .name = "matter temperature update"
    };
    ESP_ERROR_CHECK(esp_timer_create(&temperature_timer_args, &matter_temperature_timer_handle));
    ESP_ERROR_CHECK(esp_timer_start_periodic(matter_temperature_timer_handle, 1000000 * MATTER_UPDATE_INTERVAL_IN_SECONDS)); //30 seconds

    const esp_timer_create_args_t humidity_timer_args = {
            .callback = &__matter_humidity_reporter,
            /* argument specified here will be passed to timer callback function */
            .arg = (void*) matter_humidity_timer_handle,
            .name = "matter humidity update"
    };
    ESP_ERROR_CHECK(esp_timer_create(&humidity_timer_args, &matter_humidity_timer_handle));
    ESP_ERROR_CHECK(esp_timer_start_periodic(matter_humidity_timer_handle, 1000000 * MATTER_UPDATE_INTERVAL_IN_SECONDS)); //30 seconds
    ESP_ERROR_CHECK(esp_event_handler_instance_register_with(view_event_handle,
                                                        VIEW_EVENT_BASE, VIEW_EVENT_SENSOR_DATA,
                                                        __view_event_handler, NULL, NULL));
    ESP_ERROR_CHECK(esp_event_handler_instance_register_with(view_event_handle,
                                                        VIEW_EVENT_BASE, VIEW_EVENT_MATTER_DASHBOARD_DATA,
                                                        __view_event_handler, NULL, NULL));
    ESP_ERROR_CHECK(esp_event_handler_instance_register_with(view_event_handle, 
                                                            VIEW_EVENT_BASE, VIEW_EVENT_SHUTDOWN, 
                                                            __view_event_handler, NULL, NULL));
    return 0;                                                        
}

